Revit 2027 API
ParameterTypeId.CouplerWidth Property
 "External Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerWidth { get; }
Public Shared ReadOnly Property CouplerWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerWidth {
	ForgeTypeId^ get ();
}
static member CouplerWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace